<?php
/**
 * mysql连接配置
 * 
 * 支持读写分离
 * 
 * 支持把不同类型的的数据存储在对应的一组主从服务器上，每个类型只有一个主机
 * 
 * 当匹配不到对应类型的配置时，使用默认的配置
 * 
 * 当匹配不到对应从机时，使用默认的对应主机，即读写不分离
 * 
 * 当匹配不到对应主从时，使用默认的主从配置
 * 
 * 配置格式：[
 * 		主服务器类型(负责CUD操作) => [
 * 			数据模型类别(允许不同类型储存在不同服务器上，缺省值default，即没有找到对应类型时，会从default中查找) => [
 * 				'dbhost'	=> 地址,
 * 				'dbport'	=> 端口,
 * 				'dbuser'	=> 用户名,
 * 				'dbpwd'		=> 密码
 * 			]
 * 		],
 * 		从服务器类型(负责R操作) => [
 * 			数据模型类别(允许不同类型储存在不同服务器上，缺省值default，即没有找到对应类型时，会从default中查找) => [
 * 				[
 * 					'dbhost'	=> 地址,
 * 					'dbport'	=> 端口,
 * 					'dbuser'	=> 用户名,
 * 					'dbpwd'		=> 密码
 * 				],(允许设置多个从属服务器，以降低负载压力)
 * 			]
 * 		]
 * ]
 */
return [
	'master'	=> [
	
		'shop'	=> [
			'dbhost'	=> '192.168.1.200',
			'dbport'	=> '3306',
			'dbuser'	=> 'root',
			'dbpwd'		=> '123123'
		],
		
	],
	'salve'		=> [
	
		'shop'	=> [
			[
				'dbhost'	=> '192.168.1.201',
				'dbport'	=> '3306',
				'dbuser'	=> 'root',
				'dbpwd'		=> '123123'
			],
			[
				'dbhost'	=> '192.168.1.202',
				'dbport'	=> '3306',
				'dbuser'	=> 'root',
				'dbpwd'		=> '123123'
			],
		],
		
	]
];