<?php

/**
 * redis连接配置
 * 
 * 支持读写分离
 * 
 * 支持把不同类型的的数据存储在对应的一组主从服务器上，每个类型只有一个主机
 * 
 * 当匹配不到对应类型的配置时，使用默认的配置
 * 
 * 当匹配不到对应从机时，使用默认的对应主机，即读写不分离
 * 
 * 当匹配不到对应主从时，使用默认的主从配置
 * 
 */

/*
return [
	'master'	=> [
		'default'	=> ['192.168.1.144', 11211],
		'order'		=> ['192.168.1.145', 11211],
		'article'	=> ['192.168.1.146', 11211]
	],
	
	'salve'		=> [
		'default'	=> [
			['192.168.1.211', 11211],
			['192.168.1.212', 11211],
			['192.168.1.213', 11211],
		],
		'order'		=> [
			['192.168.1.214', 11211],
			['192.168.1.215', 11211],
		],
		'article'	=> [
			['192.168.1.216', 11211],
			['192.168.1.217', 11211],
		]
	]
]; 
*/

return [
	'master'	=> [ 'default' => ['127.0.0.1', 6379] ],
];
